clc;clear

Kv=@(n) (2*n+1)./((n.^2+1).*((n+1).^2+1)); 

% 时间区间
tspan = [0, 100];
history = 1; 

A=[-0.25,1.25,-2.5,5,-7.75,11.75
-0.15,0.75,-1.5,3,-4.65,7.05
-0.05,0.25,-0.5,1,-1.55,2.35
-0.0206,0.1029,-0.2059,0.4118,-0.6382,0.9676
-0.0102,0.0509,-0.1018,0.2036,-0.3156,0.4785
-0.0057,0.0286,-0.0572,0.1143,-0.1772,0.2687];
B=[0,2,-3,7,-10,16
0,-1.2,7.8,-10.2,20.4,-26.4
0,-0.4,-2.4,11.6,-12.2,24.2
0,-0.1647,-0.9882,-3.4588,14.7412,-13.0941
0,-0.0814,-0.4887,-1.7104,-4.4796,17.7557
0,-0.0457,-0.2744,-0.9605,-2.5156,-5.4886];

Al=A+B;
v6=(Kv([0:5]))';
ts=-1:0.01:0;
y_0=vec_re_koorn_approx(ts,ones(1,length(ts))*history,1,6); %设定初值

sol = dde23(@ddefunc, 1, history, tspan);
sol1= ode45(@(t, x) odefunc(t, x, Al, v6), tspan, y_0);

figure(1);
plot(sol.x, sol.y,sol1.x,sum(sol1.y));
legend('truth','kw');
xlabel('Time t');
ylabel('x(t)');
grid on;


function dxdt = ddefunc(t, x, Z)
    % Z 是 x(t-1) 的值
    x_tau = Z;
    dxdt = x-x^3-0.75*x_tau;
end

function dxdt = odefunc(t, x, Al, v6)
    dxdt=Al*x-(sum(x))^2*(1.5+sum(x))*v6;
end